app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index # GET /events
    if not Event.updateActive()
      flash[:error] = 'Could not retrieve events properly. Please try again.'
    end
    @events = Event.find_all_by_active(true)
    reminders = Reminder.where(user_id: current_user.id)
    @notifies = reminders.map{ |r| r.event_id }

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show # GET /events/:id
    @event = Event.find_by_id(params[:id])

INSERT INTO "events" ("created_at", "description", "time", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create # POST /events
    @event = Event.new params[:event]

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit # GET /events/:id/edit
    @event = Event.find params[:id]